/* -----------------------------------------------------------------------------
  Filename:     frfm.h
  Description:  Toolversion: 01.00.35.01.21.00.21.01.00.00
                
                Serial Number: CBD1210021
                Customer Info: Nxtr
                               Package: CBD_Chrysler_SLP1_UDS_Sgl
                               Micro: TexasInstruments TMS570 - TMX570LS0805APGEQQ1
                               Compiler: Texas Instruments 4.9.5
                Manufacturer : Chrysler (Car)
                
                Configuration: C:\cmsynergy\My_CL\Chrysler_LWR_EPS_TMS570\Tools\AsrProject\GENy\EPS_PN_4102_EI1555.cdi
                
                
                Interface of DiagFrfm visible to any application.

  Generated by  DtcGen v3.20.1 (2012-08-17)  at:  2014-02-06 21:12:42 -05:00
 ----------------------------------------------------------------------------- */
/* -----------------------------------------------------------------------------
  C O P Y R I G H T
 -------------------------------------------------------------------------------
  Copyright (c) 2004-2012 by Vctr Informatik GmbH. All rights reserved.
 
  This software is copyright protected and proprietary to Vctr Informatik 
  GmbH.
  
  Vctr Informatik GmbH grants to you only those rights as set out in the 
  license conditions.
  
  All other rights remain with Vctr Informatik GmbH.
 -------------------------------------------------------------------------------

#define kFrfmConfirmedDTCBit                                            0x08u
#define kFrfmTestNotCompletedSinceLastClearBit                          0x10u
#define kFrfmTestFailedSinceLastClearBit                                0x20u
#define kFrfmTestNotCompletedThisOperationCycleBit                      0x40u
#define kFrfmWarningIndicatorRequestedBit                               0x80u




/* -----------------------------------------------------------------------------
    &&&~ Datatype definitions
 ----------------------------------------------------------------------------- */

typedef enum
{
  frfmRC_OK                 = 0,
  frfmRC_NoMoreData         = 1,
  frfmRC_Failed             = 2,
  frfmRC_WrongDTC           = 3,
  frfmRC_WrongRecordNumber  = 4
} t_FrfmReturnCode;

typedef vuint8 t_FrfmRecordNumber;
typedef vuint8 t_FrfmDTCStatusMask;


typedef enum
{
  frfmDO_ChronoStack              = 0
#if defined (FRFM_ENABLE_HISTORICALSTACK)
 ,frfmDO_HistoricalStack          = 1
#endif
#if defined (FRFM_ENABLE_DTC_DEBOUNCING)
 ,frfmDO_FaultDetectionCounter    = 2
#endif
#if defined (FRFM_ENABLE_REPORT_ALLSUPPORTED)
 ,frfmDO_AllSupported             = 3
#endif
} t_FrfmDTCOrigin;


typedef vuint8 t_FrfmDtcMutualExclusionRef; /* datatype to index the count of elements of the mutual exclusion matrix */
typedef vuint8 t_FrfmMutualListLength; /* datatype to store max. length of each mutual exclusion sub-list */
typedef vuint32 t_FrfmDtcNumType; /* DTC number type is dependent on the GENtool settings. */
typedef vuint8 t_FrfmDtcSfnType; /* DTC number type is dependent on total DTC count(+1) found in the database. */
typedef vuint8 t_FrfmDtcChronoRefType; /* DTC number type is dependent on chronological stack size. */
typedef vuint8 t_FrfmAddEnvIndexType; /* DTC number type is dependent on pre-calculated maximum additional environmental data size. */
/* Handles of the all possible configurations (fault memory description) used as a parameter for FrfmInitPowerOn()!!! */
typedef enum
{
  FRFM_CFG_EPS_PN_4102_EI1555 =  0
} t_FrfmNumConfigs;
typedef enum
{
  ignitionRun                   = 0,
  ignitionAccessory             = 1,
  ignitionOff                   = 2,
  engineStart                   = 3,
  ignitionUnknown               = 4
} t_FrfmIgnitionState;

typedef enum
{
  /* unused                     = 0 */ 
  testFailed                    = 1
 ,testPassed                    = 2
  /* unused                     = 3 */
#if defined (FRFM_ENABLE_DTC_DEBOUNCING)
  /* unused                     = 4 */
 ,monitorPreFailed              = 5
 ,monitorPrePassed              = 6
#endif
} t_FrfmSetEventStatus;

typedef enum
{
  storageEnable                 = 0,
  storageDisable                = 1
} t_FrfmStorageState;

typedef enum
{
  frfmIODFuseStateOut           = 0,
  frfmIODFuseStateIn            = 1,
  frfmIODFuseStateUnknown       = 2
} t_FrfmIODFuseState;

typedef enum
{
  frfmFalse                     = 0,
  frfmTrue                      = 1
} t_FrfmBool;


typedef vuint16 t_FrfmOdometer;
typedef vuint16 t_FrfmVoltage;

typedef struct
{
#if defined ( C_CPUTYPE_BITORDER_MSB2LSB )
# if defined (FRFM_ENABLE_WARNINGINDICATOR_STATUS)
  vbittype bWarningIndicatorRequested:1;           /*0x80*/
# else
  vbittype unused7:1;
# endif
# if defined (FRFM_ENABLE_TNCTOC_BIT_STATUS)
  vbittype bTestNotCompletedThisOperationCycle:1;  /*0x40*/
# else
  vbittype unused6:1;
#  define bTestNotCompletedThisOperationCycle unused6     /* only internally required */
# endif
# if defined (FRFM_ENABLE_TESTFAILEDSINCEL_CLEAR_STATUS)
  vbittype bTestFailedSinceLastClear:1;            /*0x20*/
# else
  vbittype unused5:1;
# endif
# if defined (FRFM_ENABLE_TNCSLC_BIT_STATUS)
  vbittype bTestNotCompletedSinceLastClear:1;      /*0x10*/
# else
  vbittype unused4:1;
# endif
  vbittype bConfirmedDTC:1;                        /*0x08*/
# if defined (FRFM_ENABLE_PREFAILED_STATUS)
  vbittype bPreFailed:1;                           /*0x04*/
#elif defined (FRFM_ENABLE_PENDINGDTC_STATUS)
  vbittype bPendingDTC:1;                          /*0x04*/
# else
  vbittype unused2:1;
# endif
# if defined (FRFM_ENABLE_TFTOC_BIT_STATUS)
  vbittype bTestFailedThisOperationCycle:1;        /*0x02*/
# else
  vbittype unused1:1;
#  define bTestFailedThisOperationCycle unused1     /* only internally required */
# endif
  vbittype bTestFailed:1;                          /*0x01*/

#else

  vbittype bTestFailed:1;                          /*0x01*/
# if defined (FRFM_ENABLE_TFTOC_BIT_STATUS)
  vbittype bTestFailedThisOperationCycle:1;        /*0x02*/
# else
  vbittype unused1:1;
#  define bTestFailedThisOperationCycle unused1     /* only internally required */
# endif
# if defined (FRFM_ENABLE_PREFAILED_STATUS)
  vbittype bPreFailed:1;                           /*0x04*/
#elif defined (FRFM_ENABLE_PENDINGDTC_STATUS)
  vbittype bPendingDTC:1;                          /*0x04*/
# else
  vbittype unused2:1;
# endif
  vbittype bConfirmedDTC:1;                        /*0x08*/
# if defined (FRFM_ENABLE_TNCSLC_BIT_STATUS)
  vbittype bTestNotCompletedSinceLastClear:1;      /*0x10*/
# else
  vbittype unused4:1;
# endif
# if defined (FRFM_ENABLE_TESTFAILEDSINCEL_CLEAR_STATUS)
  vbittype bTestFailedSinceLastClear:1;            /*0x20*/
# else
  vbittype unused5:1;
# endif
# if defined (FRFM_ENABLE_TNCTOC_BIT_STATUS)
  vbittype bTestNotCompletedThisOperationCycle:1;  /*0x40*/
# else
  vbittype unused6:1;
#  define bTestNotCompletedThisOperationCycle unused6   /* only internally required */
# endif
# if defined (FRFM_ENABLE_WARNINGINDICATOR_STATUS)
  vbittype bWarningIndicatorRequested:1;           /*0x80*/
# else
  vbittype unused7:1;
# endif
#endif
} t_FrfmDtcStatusByte_s;

typedef t_FrfmDtcStatusByte_s t_FrfmGetEventStatus;

typedef union
{
  t_FrfmDtcStatusByte_s s;
  vuint8  c;
} t_FrfmDtcStatusByte;

/* Chrono Stack */
typedef struct
{
 t_FrfmDtcChronoRefType  ref;
 t_FrfmDtcSfnType        dtcInternalNumber;
} t_FrfmChronoStackManager;

typedef vuint16 t_checksum;

typedef struct
{
 /* t_FrfmDtcInternalLength  dtcInternalNumber; stored in ChronoStackManager */
 /* t_FrfmDtcStatusByte      dtcStatusByte;  stored in dtcStatusByte */
 /* vbittype                 occurenceFlag;  stored in ROM */
 vuint16                  originalOdometer;
 vuint16                  mostRecentOdometer;
#if defined (FRFM_ENABLE_FIRST_CONFIRMED_ENV_DATA)
 vuint16                  envDataIndex_firstConfirmed;
#endif
#if defined (FRFM_ENABLE_MOST_RECENT_ENV_DATA)
 vuint16                  envDataIndex_mostRecent;
#endif
